{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "dense_32", "class_name": "Dense", "config": {"name": "dense_32", "trainable": false, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "leaky_re_lu_28", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_28", "trainable": false, "alpha": 0.009999999776482582}, "inbound_nodes": [[["dense_32", 0, 0, {}]]]}, {"name": "dense_33", "class_name": "Dense", "config": {"name": "dense_33", "trainable": false, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}]]]}, {"name": "leaky_re_lu_29", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_29", "trainable": false, "alpha": 0.009999999776482582}, "inbound_nodes": [[["dense_33", 0, 0, {}]]]}, {"name": "dense_34", "class_name": "Dense", "config": {"name": "dense_34", "trainable": false, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_29", 0, 0, {}]]]}, {"name": "leaky_re_lu_30", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_30", "trainable": false, "alpha": 0.009999999776482582}, "inbound_nodes": [[["dense_34", 0, 0, {}]]]}, {"name": "dense_35", "class_name": "Dense", "config": {"name": "dense_35", "trainable": false, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_30", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["dense_35", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}